Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-MC_DFP/1.0.32/svd/PIC32CM6408MC00048.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>DIVAS</name>
         <version>U22581.0.0</version>
         <description>Divide and Square Root Accelerator</description>
         <groupName>DIVAS</groupName>
         <prependToName>DIVAS_</prependToName>
         <baseAddress>0x48000000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x1C</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CTRLA</name>
               <description>Control</description>
               <addressOffset>0x0</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>SIGNED</name>
                     <description>Signed</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DLZ</name>
                     <description>Disable Leading Zero Optimization</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>STATUS</name>
               <description>Status</description>
               <addressOffset>0x4</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>BUSY</name>
                     <description>DIVAS Accelerator Busy</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBZ</name>
                     <description>Writing a one to this bit clears DBZ to zero</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DIVIDEND</name>
               <description>Dividend</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DIVIDEND</name>
                     <description>DIVIDEND</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DIVISOR</name>
               <description>Divisor</description>
               <addressOffset>0xC</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DIVISOR</name>
                     <description>DIVISOR</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RESULT</name>
               <description>Result</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RESULT</name>
                     <description>RESULT</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>REM</name>
               <description>Remainder</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>REM</name>
                     <description>REM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SQRNUM</name>
               <description>Square Root Input</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SQRNUM</name>
                     <description>Square Root Input</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>DMAC</name>
         <version>U22232f0</version>
         <description>Direct Memory Access Controller</description>
         <groupName>DMAC</groupName>
         <prependToName>DMAC_</prependToName>
         <baseAddress>0x41006000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x50</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>DMAC</name>
            <value>7</value>
         </interrupt>
         <registers>
            <register>
               <name>CTRL</name>
               <description>Control</description>
               <addressOffset>0x0</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>SWRST</name>
                     <description>Software Reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMAENABLE</name>
                     <description>DMA Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CRCENABLE</name>
                     <description>CRC Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LVLEN0</name>
                     <description>Priority Level 0 Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LVLEN1</name>
                     <description>Priority Level 1 Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LVLEN2</name>
                     <description>Priority Level 2 Enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LVLEN3</name>
                     <description>Priority Level 3 Enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CRCCTRL</name>
               <description>CRC Control</description>
               <addressOffset>0x2</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>CRCBEATSIZE</name>
                     <description>CRC Beat Size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>CRCBEATSIZESelect</name>
                        <enumeratedValue>
                           <name>BYTE</name>
                           <description>8-bit bus transfer</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HWORD</name>
                           <description>16-bit bus transfer</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WORD</name>
                           <description>32-bit bus transfer</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CRCPOLY</name>
                     <description>CRC Polynomial Type</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>CRCPOLYSelect</name>
                        <enumeratedValue>
                           <name>CRC16</name>
                           <description>CRC-16 (CRC-CCITT)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CRC32</name>
                           <description>CRC32 (IEEE 802.3)</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CRCSRC</name>
                     <description>CRC Input Source</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                     <enumeratedValues>
                        <name>CRCSRCSelect</name>
                        <enumeratedValue>
                           <name>NOACT</name>
                           <description>No action</description>
                           <value>0x00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IO</name>
                           <description>I/O interface</description>
                           <value>0x01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CHN0</name>
                           <description>DMA Channel 0</description>
                           <value>0x20</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CHN1</name>
                           <description>DMA Channel 1</description>
                           <value>0x21</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CHN2</name>
                           <description>DMA Channel 2</description>
                           <value>0x22</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CHN3</name>
                           <description>DMA Channel 3</description>
                           <value>0x23</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CHN4</name>
                           <description>DMA Channel 4</description>
                           <value>0x24</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CHN5</name>
                           <description>DMA Channel 5</description>
                           <value>0x25</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CHN6</name>
                           <description>DMA Channel 6</description>
                           <value>0x26</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CHN7</name>
                           <description>DMA Channel 7</description>
                           <value>0x27</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CHN8</name>
                           <description>DMA Channel 8</description>
                           <value>0x28</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CHN9</name>
                           <description>DMA Channel 9</description>
                           <value>0x29</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CHN10</name>
                           <description>DMA Channel 10</description>
                           <value>0x2A</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CHN11</name>
                           <description>DMA Channel 11</description>
                           <value>0x2B</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CRCDATAIN</name>
               <description>CRC Data Input</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CRCDATAIN</name>
                     <description>CRC Data Input</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CRCCHKSUM</name>
               <description>CRC Checksum</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CRCCHKSUM</name>
                     <description>CRC Checksum</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CRCSTATUS</name>
               <description>CRC Status</description>
               <addressOffset>0xC</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>CRCBUSY</name>
                     <description>CRC Module Busy</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CRCZERO</name>
                     <description>CRC Zero</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DBGCTRL</name>
               <description>Debug Control</description>
               <addressOffset>0xD</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>DBGRUN</name>
                     <description>Debug Run</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QOSCTRL</name>
               <description>QOS Control</description>
               <addressOffset>0xE</addressOffset>
               <size>8</size>
               <resetValue>0x2A</resetValue>
               <fields>
                  <field>
                     <name>WRBQOS</name>
                     <description>Write-Back Quality of Service</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>WRBQOSSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Background (no sensitive operation)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOW</name>
                           <description>Sensitive Bandwidth</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MEDIUM</name>
                           <description>Sensitive Latency</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH</name>
                           <description>Critical Latency</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FQOS</name>
                     <description>Fetch Quality of Service</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>FQOSSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Background (no sensitive operation)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOW</name>
                           <description>Sensitive Bandwidth</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MEDIUM</name>
                           <description>Sensitive Latency</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH</name>
                           <description>Critical Latency</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DQOS</name>
                     <description>Data Transfer Quality of Service</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>DQOSSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Background (no sensitive operation)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOW</name>
                           <description>Sensitive Bandwidth</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MEDIUM</name>
                           <description>Sensitive Latency</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH</name>
                           <description>Critical Latency</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
